package command.actions;

import command.Command;

public class HelpCommand implements Command {

    @Override
    public String name() {
        return "Показати довідку";
    }

    @Override
    public void execute() {
        System.out.println("""
                === ДОВІДКА ===
                Програма моделює склад солодощів та подарунки.
                
                Головні розділи:
                1) Файли — збереження/завантаження солодощів і подарунків.
                2) Склад солодощів — додавання, редагування, видалення солодощів.
                3) Керування подарунками — створення, вибір поточного подарунка.
                4) Поточний подарунок — додавання солодощів, очищення, підрахунок ваги та ціни.

                Для вибору пункту меню — введіть номер і натисніть Enter.
                """);
    }
}

