package command.actions;

import command.Command;

public class HelpCommand implements Command {

    @Override
    public String name() {
        return "Показати довідку";
    }

    @Override
    public void execute() {
        System.out.println("""
                === Довідка ===
                Ця програма дозволяє керувати складом солодощів та подарунками.
                Основні можливості
                1) Склад солодощів:
                   • додавання, редагування, видалення, відновлення
                   • пошук за ID, містом, виробником, вмістом цукру
                   • сортування за ціною, вагою, цукром, свіжістю, вагою, ID
                   • завантаження та збереження у файл
                
                2) Подарунки:
                   • створення, видалення, відновлення, вибір поточного подарунка
                   • додавання / видалення солодощів у подарунку
                   • очищення подарунка від прострочених солодощів
                   • визначення ваги та ціни подарунка
                   • сортування солодощів у подарунку (включно з какао % для шоколаду)
                   • пошук за вмістом цукру
                
                3) Робота з файлами:
                   • окреме збереження солодощів і подарунків
                   • окреме завантаження солодощів і подарунків
                
                4) Інше:
                   • показ поточного складу і поточного подарунка
                   • форматований вивід солодощів з урахуванням категорії
  
                """);
    }
}

